app/views/users/show.html.erb

<div class="posts-container">
  <% @user.posts.each do |t| %>
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 3