app/views/posts/show.html.erb


  <h3>いいね件数: <%= @post.likes.count %></h3>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 17

    <div>
      <%= c.user.email unless c.user.blank? %>
---
SELECT `users`.* FROM `users` INNER JOIN `likes` ON `users`.`id` = `likes`.`user_id` WHERE `likes`.`post_id` = 42