app/controllers/posts_controller.rb

SELECT COUNT(*) FROM (SELECT 1 AS one FROM `posts` WHERE (((body LIKE '%福岡%' ) OR (fishname LIKE '%福岡%' )) OR (basyo LIKE '%福岡%' )) LIMIT 5 OFFSET 0) subquery_for_count
SELECT `posts`.* FROM `posts` WHERE (((body LIKE '%福岡%' ) OR (fishname LIKE '%福岡%' )) OR (basyo LIKE '%福岡%' )) LIMIT 5 OFFSET 0
SELECT DISTINCT `posts`.`fishname` FROM `posts`
---
    def index
        if params[:search] == nil
            @posts= Post.all.page(params[:page]).per(5)
        elsif params[:search] == ''
            @posts= Post.all.page(params[:page]).per(5)
        else
            #部分検索
            @posts = Post.where("body LIKE ? ",'%' + params[:search] + '%').page(params[:page]).per(5)
        end
        @all_ranks = Post.find(Like.group(:post_id).order('count(post_id) desc').limit(3).pluck(:post_id))
        @fishname = Post.select(:fishname).distinct

INSERT INTO `posts` (`created_at`, `updated_at`, `body`, `user_id`, `image`, `fishname`, `latitude`, `longitude`, `size`, `date`, `basyo`) VALUES ('2020-08-31 10:38:43.734037', '2020-08-31 10:38:43.734037', 'ラララライ', 3, 'IMG_7390.JPG', 'アジ', 33.68123542061633, 130.310306375, 21.0, '2020-08-31 10:38:00', '福岡県')
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`fishname` IS NULL ORDER BY `posts`.`size` DESC
---
    def rank
        @fish = Post.where(fishname:params[:name]).order(size: :desc)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 11 LIMIT 1
---
    def update
        @post = Post.find(params[:id])

DELETE FROM `posts` WHERE `posts`.`id` = 18
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 18 LIMIT 1
---
    def destroy
        Post.find(params[:id]).destroy