app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id]) #追記
    if params[:search] == nil
      @posts= Post.all.page(params[:page]).per(5)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT COUNT(*) FROM (SELECT 1 AS one FROM `posts` ORDER BY `posts`.`id` DESC LIMIT 5 OFFSET 0) subquery_for_count
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1