app/models/user.rb

SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`post_id` = 3 LIMIT 1
---
  def already_liked?(post)
    self.likes.exists?(post_id: post.id)